ERP.belugaerp/src/Enums/ТипыТранспортаЕГАИС/ТипыТранспортаЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыТранспортаЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Автомобиль</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Авиарейс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>МорскойКонтейнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЖелезнодорожныйВагон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/ВидыДокументовЕГАИС/ВидыДокументовЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыДокументовЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТНОтказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТНПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктТТНРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>бг_АктОбУничтоженииФСМ</name>
  </enumValues>
  <enumValues>
    <name>бг_ДобавлениеНовойПродукцииЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияАктаОбУничтожении</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияОтчетаОбИмпорте</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияОтчетаОПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросНаОтменуПроведенияПланируемогоВвоза</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗапросССП</name>
  </enumValues>
  <enumValues>
    <name>бг_ЗаявлениеОВыдачеФСМ</name>
  </enumValues>
  <enumValues>
    <name>бг_КвитанцияОтчетОбИспользованииФСМ</name>
    <comment>ReportUsingFSM</comment>
  </enumValues>
  <enumValues>
    <name>бг_НакладнаяНаВыдачуФСМ</name>
  </enumValues>
  <enumValues>
    <name>бг_ОтветНаЗапросССП</name>
  </enumValues>
  <enumValues>
    <name>бг_ОтчетОбИмпортеПродукцииЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_ОтчетОПроизводствеЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_УведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_ПланируемыйВвозЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>бг_УведомлениеОРегистрацииДвиженияОтчетаОбИмпортеПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросДанныхОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаСписания</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияМеждуРегистрами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияПоСправке2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИнформацияОбОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИсторияСправок2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаНеобработанныеТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОбработанныеЧеки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗапросТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИсторияСправок2ПоТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Квитанция</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхождений</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхожденийПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияВходящейТранспортнойНакладной</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияПолученЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КвитанцияПроведенЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАкцизныхМарок</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросДанныхОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияМеждуРегистрами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияПоСправке2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИнформацияОбОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИсторияСправок2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаНеобработанныеТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОбработанныеЧеки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре3</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки1</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки2</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТранспортнаяНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияАктаПостановкиНаБаланс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияТТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/CommonModules/бг_ТранспортнаяНакладнаяЕГАИСИнтеграция/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	СтрокиСРеквизитом = РеквизитыИСвойства.Реквизиты.НайтиСтроки(Новый Структура("ИмяСвойстваXDTO", "Идентификатор"));
	Для каждого СтрокаРеквизита Из СтрокиСРеквизитом Цикл
		СтрокаРеквизита.ИмяСвойстваXDTO = "";
	КонецЦикла;
	ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства, ФорматСообщения);
КонецПроцедуры

Процедура ЗаполнитьТекстыЗапросовУсловиями(ТекстЗапроса, ТекстЗапросаТаблицаКлючей, ПараметрыЗапроса, 
				НастройкаВыгрузки, Объект, СтандартнаяОбработка) Экспорт
	
	ТекстПоиска = 	"NULL КАК бг_Идентификатор,";
	ТекстЗамены =	"ВыгружаемыйОбъект.Идентификатор КАК бг_Идентификатор,";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);

	ТекстПоиска = 	"ВыгружаемыйОбъект.ТипТранспорта КАК ТипТранспорта_ЗначениеРеквизитаЗначениеПеречисления,";
	ТекстЗамены =	
	"ВЫБОР 
	|	КОГДА ВыгружаемыйОбъект.ТипТранспорта = ЗНАЧЕНИЕ(Перечисление.ТипыТранспортаЕГАИС.ПустаяСсылка) 
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыТранспортаЕГАИС.Автомобиль) 
	|	ИНАЧЕ ВыгружаемыйОбъект.ТипТранспорта 
	|КОНЕЦ КАК ТипТранспорта_ЗначениеРеквизитаЗначениеПеречисления,";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);

	ТекстПоиска = 	"&УсловиеЗапроса";
	ТекстЗамены =	
	"&УсловиеЗапроса
	| И НЕ ВыгружаемыйОбъект.ИдентификаторЕГАИС = """"";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);
КонецПроцедуры

Функция ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения) Экспорт
	
	Перем адаптер_обработчикиСобытийСтандартный;
	адаптер_обработчикиСобытийСтандартный = ОбщегоНазначения.ОбщийМодуль("адаптер_обработчикиСобытийСтандартный");
	
	ДанныеОбъекта = адаптер_обработчикиСобытийСтандартный.ПолучитьДанныеВыгружаемогоОбъекта(Объект, ДанныеСообщения);
	
	Если ДанныеОбъекта.Реквизиты.Количество() > 0 Тогда
		
		Операции = Новый Массив;
		Операции.Добавить(Перечисления.ВидыДокументовЕГАИС.ТранспортнаяНакладная);
		
		РеквизитыОбъекта = ДанныеОбъекта.Реквизиты[0];
		РеквизитыОбъекта.Вставить("ИдентификаторЗапросаАкта", бг_ТТНВходящаяЕГАИСИнтеграция.ИдентификаторЗапросаЕГАИС(Объект, Операции));
	КонецЕсли;
	
	Возврат ДанныеОбъекта;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства, ФорматСообщения)
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, Метаданные.Документы.ТранспортнаяНакладнаяЕГАИС, ,
		"ИдентификаторЗапросаАкта", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	адаптер_НастройкиОбмена.ДобавитьРеквизит(РеквизитыИСвойства, Метаданные.Документы.ТранспортнаяНакладнаяЕГАИС, ,
		"бг_Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	
КонецПроцедуры

#КонецОбласти
